OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1527.h
#define CCP6M0                  CCP6CONbits.CCP6M0              // bit 0
#define CCP6M1                  CCP6CONbits.CCP6M1              // bit 1
#define CCP6M2                  CCP6CONbits.CCP6M2              // bit 2
#define CCP6M3                  CCP6CONbits.CCP6M3              // bit 3
#define DC6B0                   CCP6CONbits.DC6B0               // bit 4
#define DC6B1                   CCP6CONbits.DC6B1               // bit 5

#define CCP7M0                  CCP7CONbits.CCP7M0              // bit 0
#define CCP7M1                  CCP7CONbits.CCP7M1              // bit 1
#define CCP7M2                  CCP7CONbits.CCP7M2              // bit 2
#define CCP7M3                  CCP7CONbits.CCP7M3              // bit 3
#define DC7B0                   CCP7CONbits.DC7B0               // bit 4
#define DC7B1                   CCP7CONbits.DC7B1               // bit 5

#define CCP8M0                  CCP8CONbits.CCP8M0              // bit 0
#define CCP8M1                  CCP8CONbits.CCP8M1              // bit 1
#define CCP8M2                  CCP8CONbits.CCP8M2              // bit 2
#define CCP8M3                  CCP8CONbits.CCP8M3              // bit 3
#define DC8B0                   CCP8CONbits.DC8B0               // bit 4
#define DC8B1                   CCP8CONbits.DC8B1               // bit 5

#define CCP9M0                  CCP9CONbits.CCP9M0              // bit 0
#define CCP9M1                  CCP9CONbits.CCP9M1              // bit 1
#define CCP9M2                  CCP9CONbits.CCP9M2              // bit 2
#define CCP9M3                  CCP9CONbits.CCP9M3              // bit 3
#define DC9B0                   CCP9CONbits.DC9B0               // bit 4
#define DC9B1                   CCP9CONbits.DC9B1               // bit 5

#define CCP10M0                 CCP10CONbits.CCP10M0            // bit 0
#define CCP10M1                 CCP10CONbits.CCP10M1            // bit 1
#define CCP10M2                 CCP10CONbits.CCP10M2            // bit 2
#define CCP10M3                 CCP10CONbits.CCP10M3            // bit 3
#define DC10B0                  CCP10CONbits.DC10B0             // bit 4
#define DC10B1                  CCP10CONbits.DC10B1             // bit 5

#define C1TSEL0                 CCPTMRS0bits.C1TSEL0            // bit 0
#define C1TSEL1                 CCPTMRS0bits.C1TSEL1            // bit 1
#define C2TSEL0                 CCPTMRS0bits.C2TSEL0            // bit 2
#define C2TSEL1                 CCPTMRS0bits.C2TSEL1            // bit 3
#define C3TSEL0                 CCPTMRS0bits.C3TSEL0            // bit 4
#define C3TSEL1                 CCPTMRS0bits.C3TSEL1            // bit 5
#define C4TSEL0                 CCPTMRS0bits.C4TSEL0            // bit 6
#define C4TSEL1                 CCPTMRS0bits.C4TSEL1            // bit 7

#define C5TSEL0                 CCPTMRS1bits.C5TSEL0            // bit 0
#define C5TSEL1                 CCPTMRS1bits.C5TSEL1            // bit 1
#define C6TSEL0                 CCPTMRS1bits.C6TSEL0            // bit 2
#define C6TSEL1                 CCPTMRS1bits.C6TSEL1            // bit 3
#define C7TSEL0                 CCPTMRS1bits.C7TSEL0            // bit 4
#define C7TSEL1                 CCPTMRS1bits.C7TSEL1            // bit 5
#define C8TSEL0                 CCPTMRS1bits.C8TSEL0            // bit 6
#define C8TSEL1                 CCPTMRS1bits.C8TSEL1            // bit 7

#define C9TSEL0                 CCPTMRS2bits.C9TSEL0            // bit 0
#define C9TSEL1                 CCPTMRS2bits.C9TSEL1            // bit 1
#define C10TSEL0                CCPTMRS2bits.C10TSEL0           // bit 2
#define C10TSEL1                CCPTMRS2bits.C10TSEL1           // bit 3

#define ADFVR0                  FVRCONbits.ADFVR0               // bit 0
#define ADFVR1                  FVRCONbits.ADFVR1               // bit 1
#define TSRNG                   FVRCONbits.TSRNG                // bit 4
#define TSEN                    FVRCONbits.TSEN                 // bit 5
#define FVRRDY                  FVRCONbits.FVRRDY               // bit 6
#define FVREN                   FVRCONbits.FVREN                // bit 7

#define IOCIF                   INTCONbits.IOCIF                // bit 0
#define INTF                    INTCONbits.INTF                 // bit 1
#define TMR0IF                  INTCONbits.TMR0IF               // bit 2, shadows bit in INTCONbits
#define T0IF                    INTCONbits.T0IF                 // bit 2, shadows bit in INTCONbits
#define IOCIE                   INTCONbits.IOCIE                // bit 3
#define INTE                    INTCONbits.INTE                 // bit 4
#define TMR0IE                  INTCONbits.TMR0IE               // bit 5, shadows bit in INTCONbits
#define T0IE                    INTCONbits.T0IE                 // bit 5, shadows bit in INTCONbits
#define PEIE                    INTCONbits.PEIE                 // bit 6
#define GIE                     INTCONbits.GIE                  // bit 7

#define IOCBF0                  IOCBFbits.IOCBF0                // bit 0
#define IOCBF1                  IOCBFbits.IOCBF1                // bit 1
#define IOCBF2                  IOCBFbits.IOCBF2                // bit 2
#define IOCBF3                  IOCBFbits.IOCBF3                // bit 3
#define IOCBF4                  IOCBFbits.IOCBF4                // bit 4
#define IOCBF5                  IOCBFbits.IOCBF5                // bit 5
#define IOCBF6                  IOCBFbits.IOCBF6                // bit 6
#define IOCBF7                  IOCBFbits.IOCBF7                // bit 7

#define IOCBN0                  IOCBNbits.IOCBN0                // bit 0
#define IOCBN1                  IOCBNbits.IOCBN1                // bit 1
#define IOCBN2                  IOCBNbits.IOCBN2                // bit 2
#define IOCBN3                  IOCBNbits.IOCBN3                // bit 3
#define IOCBN4                  IOCBNbits.IOCBN4                // bit 4
#define IOCBN5                  IOCBNbits.IOCBN5                // bit 5
#define IOCBN6                  IOCBNbits.IOCBN6                // bit 6
#define IOCBN7                  IOCBNbits.IOCBN7                // bit 7

#define IOCBP0                  IOCBPbits.IOCBP0                // bit 0
#define IOCBP1                  IOCBPbits.IOCBP1                // bit 1
#define IOCBP2                  IOCBPbits.IOCBP2                // bit 2
#define IOCBP3                  IOCBPbits.IOCBP3                // bit 3
#define IOCBP4                  IOCBPbits.IOCBP4                // bit 4
#define IOCBP5                  IOCBPbits.IOCBP5                // bit 5
#define IOCBP6                  IOCBPbits.IOCBP6                // bit 6
#define IOCBP7                  IOCBPbits.IOCBP7                // bit 7

#define LATA0                   LATAbits.LATA0                  // bit 0
#define LATA1                   LATAbits.LATA1                  // bit 1
#define LATA2                   LATAbits.LATA2                  // bit 2
#define LATA3                   LATAbits.LATA3                  // bit 3
#define LATA4                   LATAbits.LATA4                  // bit 4
#define LATA5                   LATAbits.LATA5                  // bit 5
#define LATA6                   LATAbits.LATA6                  // bit 6
#define LATA7                   LATAbits.LATA7                  // bit 7

#define LATB0                   LATBbits.LATB0                  // bit 0
#define LATB1                   LATBbits.LATB1                  // bit 1
#define LATB2                   LATBbits.LATB2                  // bit 2
#define LATB3                   LATBbits.LATB3                  // bit 3
#define LATB4                   LATBbits.LATB4                  // bit 4
#define LATB5                   LATBbits.LATB5                  // bit 5
#define LATB6                   LATBbits.LATB6                  // bit 6
#define LATB7                   LATBbits.LATB7                  // bit 7

